system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs ("liblduSolvers.so");

application     steadyStateNaturalConvection;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         300;

deltaT          0.01;

writeControl    timeStep;

writeInterval   100;

purgeWrite      3;

writeFormat     ascii;

writePrecision  6;

writeCompression compressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

libs ("libnanoFluid4Foam.so");//-nanoFluid4Foam

InfoSwitches
{
    writePrecision  6;
    writeJobInfo    0;
    allowSystemOperations 1;
}

functions
{
    postProcess
    {
        functionObjectLibs	("libutilityFunctionObjects.so");
        type			coded;
        enabled			true;
        outputControl		outputTime;//timeStep;
        redirectType		postProcess;

        code
        #{
            std::ofstream output;
            output.open("postProcess.txt",std::ofstream::app);

            //- constants
            /*scalar rhobf = 996.5;
            scalar mubf = 8.5e-4;
            scalar kappabf = 0.628;
            scalar Cpbf = 4181.0;
            scalar betabf = 2.6e-4;
            scalar nubf = mubf/rhobf;
            scalar alphabf = kappabf/(rhobf*Cpbf);
            scalar deltaTemp = 10.0;
            scalar charL = 0.4;
            scalar g = .00000007726636364167;

            scalar Prbf = nubf/alphabf;
            scalar Grbf = (g*betabf*deltaTemp*pow(charL,3)) / (pow(nubf,2));
            scalar Rabf = (g*betabf*deltaTemp*pow(charL,3)) / (nubf*alphabf);*/

            //- constants
            scalar kappabf = 0.628;
            scalar deltaTemp = 10.0;
            scalar charL = 0.4;

            //- lookup fields
            const volScalarField& T = mesh().lookupObject<volScalarField>("T");
            const volScalarField& kappaEff = mesh().lookupObject<volScalarField>("kappaEff");
            surfaceScalarField gradT = fvc::snGrad(T);

            //- find id and compute Nusselt number
            label heaterID = T.mesh().boundaryMesh().findPatchID("heater");
            scalar heaterArea = sum(T.mesh().magSf().boundaryField()[heaterID]);
            scalar heaterHeatFluxAvg = sum(kappaEff.boundaryField()[heaterID]*gradT.boundaryField()[heaterID]*T.mesh().magSf().boundaryField()[heaterID])/heaterArea;
            scalar heaterhAvg = heaterHeatFluxAvg/deltaTemp;
            scalar NusseltAvg = (heaterhAvg*charL)/(kappabf);


            //- save data
            output << NusseltAvg << "\n";
            output.close();
        #};
    }

}

// ************************************************************************* //
