constant/nanoFluidProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      nanoFluidProperties;
}
//************************************************ baseFluid ************************************************//
baseFluid			(water);
baseFluidDynamicViscosityModel  Newtonian;
moleFraction			(1.0);
#include "materialsDict.H";


//************************************************ particle ************************************************//
particle			( (NEPCMOne MNEPCM) );
particleDict
{
    NEPCMOne
    {
        MNEPCMCoreDict
        {
            Components		(n_Docosane);
            moleFraction	(1.0);
        }
        MNEPCMShellDict
        {
            Components		(PMMA);
            moleFraction	(1.0);
        }
	d			50e-9;
	weightRatio		0.8;
    }
}


//************************************************ nanoFluid ************************************************//
nanoFluidModel			(mono Homogenous);//Homogenous//Heterogeneous
thermalConductivityModel	HamiltonCrosser;
HamiltonCrosserCoeffs
{
    lambda			3.0;
}

dynamicViscosityModel		Brinkman;
BrinkmanCoeffs{}


//***************** Heterogeneous *****************//
brownianDiffusivityModel	Brownian;
BrownianCoeffs
{
    dnp				(33.0e-9);
}

thermophoresisDiffusivityModel		McNabMeisen;
McNabMeisenCoeffs{}


//############################################### End #######################################################//
